DataProcessors/ВыгрузкаДанныхМТ102.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаДанныхМТ102</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыНалоговВзносовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНалоговВзносовОтчислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОППВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ВыгрузкаДанныхМТ102/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ДанныеДокумента") Тогда
		ДанныеДокумента = Новый Структура();
		ДанныеДокумента = Параметры.ДанныеДокумента;
	Иначе
		ВызватьИсключение НСтр("ru = 'Обработка не предназначена для интерактивного использования!'");
	КонецЕсли;
	
	Объект.Кодировка = Элементы.Кодировка.СписокВыбора[0].Значение;
	
	Если ДанныеДокумента.ВидОперации = "ПеречислениеВзносов" 
		И ДанныеДокумента.Ведомости.Количество() > 0 Тогда
		ВидНалогаВзносаОтчисления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокумента.Ведомости[0], "ВидНалогаВзносаОтчисления");
	Иначе
		ВидНалогаВзносаОтчисления = Неопределено;
	КонецЕсли;
	
	Если НЕ ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
		РазделятьСуммыПоПериодуЗадолженности = Истина;
		ПолеPERIODвЗаголовке = 0;
	КонецЕсли;
	
	ИспользоватьФорматMX = ЗарплатаКадрыРасширенныйРК.ИспользоватьФорматMX();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.КаталогВыгрузки) Тогда
		Объект.КаталогВыгрузки = РаботаСФайламиСлужебныйКлиент.РабочийКаталогПользователя();
	КонецЕсли;
	
	// после загрузки сохраненных настроек
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
		
	Настройки.Вставить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Кодировка%1", ВидНалогаВзносаОтчисления),    Объект.Кодировка);
	Настройки.Вставить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВключатьПолеFT%1", ВидНалогаВзносаОтчисления),  ВключатьПолеFT);
	Настройки.Вставить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВключатьПолеPRT%1", ВидНалогаВзносаОтчисления), ВключатьПолеPRT);
	Настройки.Вставить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВключатьПолеPSO%1", ВидНалогаВзносаОтчисления), ВключатьПолеPSO);
    Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
		Настройки.Вставить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("РазделятьСуммыПоПериодуЗадолженности%1", ВидНалогаВзносаОтчисления), РазделятьСуммыПоПериодуЗадолженности);		
		Настройки.Вставить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ПолеPERIODвЗаголовке%1", ВидНалогаВзносаОтчисления), ПолеPERIODвЗаголовке);		
	КонецЕсли;
	
	//удалим предопределенные настройки и дополним необходимыми по уже сохраненным видам операции
	Если Настройки.Получить("Объект.Кодировка") <> Неопределено Тогда
		Настройки.Удалить("Объект.Кодировка");
	КонецЕсли;
	
	Если Настройки.Получить("ВключатьПолеPRT") <> Неопределено Тогда
		Настройки.Удалить("ВключатьПолеPRT");
	КонецЕсли;

	Если Настройки.Получить("ВключатьПолеFT") <> Неопределено Тогда
		Настройки.Удалить("ВключатьПолеFT");
	КонецЕсли;

	Если Настройки.Получить("ВключатьПолеPSO") <> Неопределено Тогда
		Настройки.Удалить("ВключатьПолеPSO");
	КонецЕсли;   
	
	Для Каждого Настройка Из НастройкиСохраненные Цикл	
		Если Настройки.Получить(Настройка.Ключ) = Неопределено Тогда			
			Настройки.Вставить(Настройка.Ключ, Настройка.Значение);
		КонецЕсли;
	КонецЦикла;
				
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)

	Для Каждого Настройка Из Настройки Цикл		
		
		Если НЕ ИспользоватьФорматMX И Настройка.Ключ = "ВключатьПоляФорматаMX" И Настройка.Значение Тогда
			Настройки.Вставить(Настройка.Ключ, Ложь);
		КонецЕсли;
		
		Если (Найти(Настройка.Ключ, "Кодировка") <> 0 И Настройка.Ключ <> "Объект.Кодировка") 
			ИЛИ (Найти(Настройка.Ключ, "ВключатьПолеFT")  <> 0 И Настройка.Ключ <> "ВключатьПолеFT")
			ИЛИ (Найти(Настройка.Ключ, "ВключатьПолеPRT") <> 0 И Настройка.Ключ <> "ВключатьПолеPRT")
			ИЛИ (Найти(Настройка.Ключ, "ВключатьПолеPSO") <> 0 И Настройка.Ключ <> "ВключатьПолеPSO")
			ИЛИ (Найти(Настройка.Ключ, "ПолеPERIODвЗаголовке") <> 0 И Настройка.Ключ <> "ПолеPERIODвЗаголовке")
			ИЛИ (Найти(Настройка.Ключ, "РазделятьСуммыПоПериодуЗадолженности") <> 0 И Настройка.Ключ <> "РазделятьСуммыПоПериодуЗадолженности") Тогда			
			
			НоваяСтрокаНастройки = НастройкиСохраненные.Добавить();
			НоваяСтрокаНастройки.Ключ = Настройка.Ключ;
			НоваяСтрокаНастройки.Значение = Настройка.Значение;
		КонецЕсли;

		Если Настройка.Ключ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Кодировка%1", ВидНалогаВзносаОтчисления) 
			 И ЗначениеЗаполнено(Настройка.Значение)Тогда
			Настройки.Вставить("Объект.Кодировка",  Настройка.Значение);		
		КонецЕсли;
		Если Настройка.Ключ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВключатьПолеFT%1", ВидНалогаВзносаОтчисления) Тогда
			Настройки.Вставить("ВключатьПолеFT",  Настройка.Значение);		
		КонецЕсли;
		Если Настройка.Ключ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВключатьПолеPRT%1", ВидНалогаВзносаОтчисления) Тогда
			Настройки.Вставить("ВключатьПолеPRT",  Настройка.Значение);		
  		КонецЕсли;  
		Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
			
			Если Настройка.Ключ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("РазделятьСуммыПоПериодуЗадолженности%1", ВидНалогаВзносаОтчисления) Тогда			
				Настройки.Вставить("РазделятьСуммыПоПериодуЗадолженности",  Настройка.Значение);		
	  		КонецЕсли;   
			Если Настройка.Ключ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ПолеPERIODвЗаголовке%1", ВидНалогаВзносаОтчисления) Тогда			
				Настройки.Вставить("ПолеPERIODвЗаголовке",  Настройка.Значение);		
	  		КонецЕсли;   
			
		Иначе

			Если Настройка.Ключ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("РазделятьСуммыПоПериодуЗадолженности%1", ВидНалогаВзносаОтчисления) Тогда			
				Настройки.Удалить(Настройка.Ключ);
	  		КонецЕсли;   
			Если ВРег(Настройка.Ключ) = ВРег(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ПолеPERIODвЗаголовке%1", ВидНалогаВзносаОтчисления)) Тогда			
				Настройки.Удалить(Настройка.Ключ);
	  		КонецЕсли;   
			Если ВРег(Настройка.Ключ) = ВРег("ПолеPERIODвЗаголовке") Тогда			
				Настройки.Удалить(Настройка.Ключ);
	  		КонецЕсли;   
	
		КонецЕсли;  		
		Если Настройка.Ключ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВключатьПолеPSO%1", ВидНалогаВзносаОтчисления) Тогда			
			Настройки.Вставить("ВключатьПолеPSO",  Настройка.Значение);		
		ИначеЕсли ТипЗнч(Настройка.Значение) = Тип("Строка") И НЕ ЗначениеЗаполнено(Настройка.Значение) Тогда
			Настройки.Удалить(Настройка.Ключ);
		КонецЕсли;  		

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения   = Новый ОписаниеОповещения("КаталогВыгрузкиПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения, , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиПослеПодключенияРасширенияРаботыСФайлами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораКаталогВыгрузки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогВыгрузки.Заголовок = НСтр("ru='Открытие каталога для передачи файлов в банк'");
	ДиалогВыбораКаталогВыгрузки.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогВыгрузки.Каталог = Объект.КаталогВыгрузки;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КаталогВыгрузкиЗавершениеВыбора", ЭтотОбъект);
	ДиалогВыбораКаталогВыгрузки.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиЗавершениеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СдачаОтчетностиЧерезТакскомСпринтерКлиентСервер.НормализоватьКаталог(Результат[0]);
	
	Объект.КаталогВыгрузки = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.КаталогВыгрузки) Тогда
		СдачаОтчетностиЧерезТакскомСпринтерКлиентСервер.НормализоватьКаталог(Объект.КаталогВыгрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения   = Новый ОписаниеОповещения("КаталогВыгрузкиОткрытиеПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения, , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиОткрытиеПослеПодключенияРасширенияРаботыСФайлами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("КаталогВыгрузкиПослеЗапускаПриложения", ЭтотОбъект), Объект.КаталогВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиПослеЗапускаПриложения(Результат, ДополнительныеПараметры) Экспорт
	// Обработка не требуется.
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ПолеPERIODвЗаголовкеПриИзменении(Элемент)
	
	Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП")
		И (ПолеPERIODВЗаголовке = 1
				ИЛИ НЕ РазделятьСуммыПоПериодуЗадолженности) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для перечисления сумм единого платежа рекомендуется устанавливать значение настроек: ""Поле PERIOD в списке"" и устанавливать значение ""Разделять сумму по периоду задолженности""'"));
	КонецЕсли;
		
	Элементы.РазделятьСуммыПоПериодуЗадолженности.Видимость = (ПолеPERIODВЗаголовке = 0);
	
	Если РазделятьСуммыПоПериодуЗадолженности = Истина 
		И ПолеPERIODВЗаголовке = 1 Тогда
		
		РазделятьСуммыПоПериодуЗадолженности = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделятьСуммыПоПериодуЗадолженностиПриИзменении(Элемент)
	
	Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП")
		И (ПолеPERIODВЗаголовке = 1
				ИЛИ НЕ РазделятьСуммыПоПериодуЗадолженности) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для перечисления сумм единого платежа рекомендуется устанавливать значение настроек: ""Поле PERIOD в списке"" и устанавливать значение ""Разделять сумму по периоду задолженности""'"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВыгрузитьПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения, , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПослеПодключенияРасширенияРаботыСФайлами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	АдресСтруктурыФайловВоВременномХранилище = ВыгрузитьНаСервере();
	
	ДанныеХранилищаФайлов = ПолучитьИзВременногоХранилища(АдресСтруктурыФайловВоВременномХранилище);
	
	ПолучаемыеФайлы = Новый Массив;
	МассивВызовов   = Новый Массив;
	
	Для Каждого ДанныеФайла Из ДанныеХранилищаФайлов Цикл
		
		АдресФайлаВоВременномХранилище = ДанныеФайла.Значение;
		ПолноеИмяФайла = ДанныеФайла.Ключ;
		
		ПозицияНачалоИмяФайла = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПоиска.СКонца);
		ПолныйКаталогВыгрузки = Лев(ПолноеИмяФайла, ПозицияНачалоИмяФайла);
		
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, АдресФайлаВоВременномХранилище);
		
		ПолучаемыеФайлы.Добавить(ОписаниеФайла);
		
	КонецЦикла;
	
	Если ПолучаемыеФайлы.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Произошли ошибки при выгрузке. Выгрузка не выполнена.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МассивВызовов.Добавить(Новый Массив);
	
	МассивВызовов[0].Добавить("НачатьПолучениеФайлов");
	МассивВызовов[0].Добавить(ПолучаемыеФайлы);
	МассивВызовов[0].Добавить("");
	МассивВызовов[0].Добавить(Ложь);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПолучаемыеФайлы", ПолучаемыеФайлы);
	ДополнительныеПараметры.Вставить("ПолныйКаталогВыгрузки", ПолныйКаталогВыгрузки);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьПослеЗапросаРазрешенияПользователя", ЭтотОбъект, ДополнительныеПараметры);
	НачатьЗапросРазрешенияПользователя(ОписаниеОповещения, МассивВызовов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПослеЗапросаРазрешенияПользователя(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сохранить файлы в указанный каталог'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьПослеПолученияФайлов", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПолучениеФайлов(ОписаниеОповещения, ДополнительныеПараметры.ПолучаемыеФайлы, , НЕ ПодключитьРасширениеРаботыСФайлами());//Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПослеПолученияФайлов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сохранить файлы в указанный каталог'"));
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Данные успешно выгружены в'");
	
	#Если НЕ ВебКлиент Тогда
		ПоказатьОповещениеПользователя(
			ТекстСообщения, "file:///" + СтрЗаменить(СокрЛП(ДополнительныеПараметры.ПолныйКаталогВыгрузки), "\", "/"),
			ДополнительныеПараметры.ПолныйКаталогВыгрузки);
	#Иначе
		ПоказатьОповещениеПользователя(
			ТекстСообщения,,
			ДополнительныеПараметры.ПолныйКаталогВыгрузки);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
    Если Форма.ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту"
        ИЛИ Форма.ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПеречислением"
		ИЛИ Форма.ДанныеДокумента.ВидОперации = "ПеречислениеПрочихВыплат" Тогда
		Элементы.ВключатьПолеPRT.Доступность = Ложь;
		Элементы.ВключатьПолеPSO.Доступность = Ложь;
	Иначе
		Элементы.ВключатьПолеPRT.Доступность = Истина;
		Элементы.ВключатьПолеPSO.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ГруппаНастройкиФорматаДляПеречисленийПравая.Видимость = Ложь;
	Элементы.РазделятьСуммыПоПериодуЗадолженности.Видимость = Ложь;
	
	Элементы.ВключатьПоляФорматаISO.Видимость = Форма.ИспользоватьФорматMX;

	Ведомости = Форма.ДанныеДокумента.Ведомости;
	ВидНалогаВзносаОтчисления = Форма.ВидНалогаВзносаОтчисления;
	
	Если ЗначениеЗаполнено(ВидНалогаВзносаОтчисления) И (ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО")) Тогда
		Элементы.ГруппаНастройкиФорматаДляПеречисленийПравая.Видимость = Истина;
		Элементы.РазделятьСуммыПоПериодуЗадолженности.Видимость = (Форма.ПолеPERIODВЗаголовке = 0);
	ИначеЕсли ВидНалогаВзносаОтчисления <> Неопределено И (ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ")
		ИЛИ ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВР")) Тогда
		Элементы.РазделятьСуммыПоПериодуЗадолженности.Видимость = (Форма.ПолеPERIODВЗаголовке = 0);
	КонецЕсли;
	Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "СО");
	ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ОПВ");
	ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ВОСМС");
	ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ООСМС");
	ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ЕП");
	ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ОППВ");
	ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВР") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ОПВР");
	Иначе
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	НастройкиВыгрузки = Новый Структура(
		"ДанныеДокумента, ФормироватьОтдельныеФайлы, ВключатьПолеFT, ВключатьПолеPRT, ВключатьПолеPSO, ПолеPERIODВЗаголовке, ПриоритетСообщения, РазделятьСуммыПоПериодуЗадолженности, ВключатьПоляФорматаMX",
		ДанныеДокумента, ФормироватьОтдельныеФайлы, ВключатьПолеFT, ВключатьПолеPRT, ВключатьПолеPSO, ПолеPERIODВЗаголовке, ПриоритетСообщения, РазделятьСуммыПоПериодуЗадолженности, ВключатьПоляФорматаMX);
		
	Возврат ОбработкаОбъект.СоздатьФайлВФорматеМТ(НастройкиВыгрузки, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
